# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

fusion_mode: concat
#node_mode: C2f
head_channel: 256

# anchors
anchors: 4

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Yolov7_E_ELAN, [256, 64]], # 4
         
   [-1, 1, V7DownSampling, [128]],  # 5-P3/8  
   [-1, 1, Yolov7_E_ELAN, [512, 128]], # 6
         
   [-1, 1, V7DownSampling, [256]],  # 7-P4/16  
   [-1, 1, Yolov7_E_ELAN, [1024, 256]], # 8
         
   [-1, 1, V7DownSampling, [512]],  # 9-P5/32  
   [-1, 1, Yolov7_E_ELAN, [1024, 256]],  # 10
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 11

  [4, 1, Conv, [head_channel]],  # 12-P2/8
  [6, 1, Conv, [head_channel]],  # 13-P3/8
  [8, 1, Conv, [head_channel]],  # 14-P4/16
  [11, 1, Conv, [head_channel]], # 15-P5/32

  [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 16 P5->P4
  [[-1, 14], 1, Fusion, [fusion_mode]], # 17
  [-1, 1, Yolov7_E_ELAN_NECK, [256, 128]], # 18-P4/16

  [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 19 P4->P3
  [[-1, 13], 1, Fusion, [fusion_mode]], # 20
  [-1, 1, Yolov7_E_ELAN_NECK, [128, 64]], # 21-P3/8

  # ------------------------------------------------#
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [[-1, 12], 1, Fusion, [fusion_mode]], #23

   [-1, 1, Yolov7_E_ELAN_NECK, [64, 32]], # 24
  # ------------------------------------------------#
   [-1, 1, Conv, [head_channel, 3, 2]],
   [ [ -1, 13, 21 ], 1, Fusion, [fusion_mode]], # 36

   [-1, 1, Yolov7_E_ELAN_NECK, [128, 64]], # 27
  # ------------------------------------------------#

  [-1, 1, Conv, [head_channel, 3, 2]], # 28 P2->P3
  [[-1, 14, 18], 1, Fusion, [fusion_mode]], # 29
  [-1, 1, Yolov7_E_ELAN_NECK, [128, 64]], # 30-P3/8

  [-1, 1, Conv, [head_channel, 3, 2]], # 31 P3->P4
  [[-1, 15], 1, Fusion, [fusion_mode]], # 32
  [-1, 1, Yolov7_E_ELAN_NECK, [256, 128]], # 33-P4/16

   [24, 1, RepConv, [256, 3, 1]], # 34-P2
   [27, 1, RepConv, [256, 3, 1]], # 35-P3
   [30, 1, RepConv, [256, 3, 1]], # 36-P4
   [33, 1, RepConv, [256, 3, 1]], # 37-P5

   [[34, 35, 36, 37], 1, IDetect_DyHead, [nc, anchors]],   # Detect(P2, P3, P4, P5)
  ]