# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors: 4

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Yolov7_E_ELAN, [256, 64]], # 4
         
   [-1, 1, V7DownSampling, [128]],  # 5-P3/8  
   [-1, 1, Yolov7_E_ELAN, [512, 128]], # 6
         
   [-1, 1, V7DownSampling, [256]],  # 7-P4/16  
   [-1, 1, Yolov7_E_ELAN, [1024, 256]], # 8
         
   [-1, 1, V7DownSampling, [512]],  # 9-P5/32  
   [-1, 1, Yolov7_E_ELAN, [1024, 256]],  # 10
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 11

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]], # 14 route backbone P4
   [[-1, -2], 1, BiFPN_Add2, [256, 256]], # 15
   
   [-1, 1, Yolov7_E_ELAN_NECK, [256, 128]], # 16

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], # 19 route backbone P3
   [[-1, -2], 1, BiFPN_Add2, [128, 128]], # 20
   
   [-1, 1, Yolov7_E_ELAN_NECK, [128, 64]], # 21
    # ------------------------------------------------#
   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ 4, 1, Conv, [ 64, 1, 1 ] ], # route backbone P2
   [[-1, -2], 1, BiFPN_Add2, [64, 64]], #25

   [-1, 1, Yolov7_E_ELAN_NECK, [64, 32]], # 26
  # ------------------------------------------------#
   [ -1, 1, MP, [ ] ],
   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -3, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 2 ] ],
   [ [ -1, -3, 22 ], 1, BiFPN_Add3, [ 64, 64 ] ], # 31

   [-1, 1, Yolov7_E_ELAN_NECK, [128, 64]], # 32
  # ------------------------------------------------#
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 17], 1, BiFPN_Add3, [128 , 128]], # 37

   [-1, 1, Yolov7_E_ELAN_NECK, [256, 128]], # 38

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 12], 1, BiFPN_Add3, [256, 256]], # 43

   [-1, 1, Yolov7_E_ELAN_NECK, [512, 256]], # 44

   [26, 1, RepConv, [128, 3, 1]], # 45-P2
   [32, 1, RepConv, [256, 3, 1]], # 46-P3
   [38, 1, RepConv, [512, 3, 1]], # 47-P4
   [44, 1, RepConv, [1024, 3, 1]], # 48-P5

   [[45, 46, 47, 48], 1, IDetect, [nc, anchors]],   # Detect(P2, P3, P4, P5)
  ]
